import { Conjugation } from '../model/Conjugation';

// remove accens chars: Find and Replace (regexp mode): [\u0300-\u036f]

export const conjugations: Conjugation[] = [
    { base: 'смотреть', ru: ['смотрю', 'смотришь', 'смотрит', 'смотрим', 'смотрите', 'смотрят'] },
    { base: 'читать', ru: ['читаю', 'читаешь', 'читает', 'читаем', 'читаете', 'читают'] },
    { base: 'хотеть', ru: ['хочу', 'хочешь', 'хочет', 'хотим', 'хотите', 'хотят'] },
    { base: 'слушать', ru: ['слушаю', 'слушаешь', 'слушает', 'слушаем', 'слушаете', 'слушают'] },
    { base: 'говорить', ru: ['говорю', 'говоришь', 'говорит', 'говорим', 'говорите', 'говорят'] },
    { base: 'мочь', ru: ['могу', 'можешь', 'может', 'можем', 'можете', 'могут'] },
    { base: 'играть', ru: ['играю', 'играешь', 'играет', 'играем', 'играете', 'играют'] },
    { base: 'есть', ru: ['ем', 'ешь', 'ест', 'едим', 'едите', 'едят'] },
    { base: 'пить', ru: ['пью', 'пьёшь', 'пьёт', 'пьём', 'пьёте', 'пьют'] },
    { base: 'повторять', ru: ['повторяю', 'повторяешь', 'повторяет', 'повторяем', 'повторяете', 'повторяют'] },
    { base: 'петь', ru: ['пою', 'поёшь', 'поёт', 'поём', 'поёте', 'поют'] },
    { base: 'ездить', ru: ['езжу', 'ездишь', 'ездит', 'ездим', 'ездите', 'ездят'] },
    { base: 'искать', ru: ['ищу', 'ищешь', 'ищет', 'ищем', 'ищете', 'ищут'] },
    { base: 'сидеть', ru: ['сижу', 'сидишь', 'сидит', 'сидим', 'сидите', 'сидят'] },
    { base: 'терять', ru: ['теряю', 'теряешь', 'теряет', 'теряем', 'теряете', 'теряют'] },
    { base: 'видеть', ru: ['вижу', 'видишь', 'видит', 'видим', 'видите', 'видят'] },
    { base: 'ненавидеть', ru: ['ненавижу', 'ненавидишь', 'ненавидит', 'ненавидим', 'ненавидите', 'ненавидят'] },
    { base: 'зависеть', ru: ['завишу', 'зависишь', 'зависит', 'зависим', 'зависите', 'зависят'] },
    { base: 'организовать', ru: ['организую', 'организуешь', 'организует', 'организуем', 'организуете', 'организуют'] },
    { base: "давать", ru: ["даю", "даёшь", "даёт", "даём", "даёте", "дают"] },
    { base: "уметь", ru: ["умею", "умеешь", "умеет", "умеем", "умеете", "умеют"] },
    { base: "ходить", ru: ["хожу", "ходишь", "ходит", "ходим", "ходите", "ходят"] },
    { base: "возвращаться", ru: ["возвращаюсь", "возвращаешься", "возвращается", "возвращаемся", "возвращаетесь", "возвращаются"] },
    { base: "советовать", ru: ["советую", "советуешь", "советует", "советуем", "советуете", "советуют"] },
    { base: "получать", ru: ["получаю", "получаешь", "получает", "получаем", "получаете", "получают"] },
    { base: "болеть", ru: ["болею", "болеешь", "болеет", "болеем", "болеете", "болеют"] },
    { base: "мочь", ru: ["могу", "можешь", "может", "можем", "можете", "могут"] },
    { base: "знать", ru: ["знаю", "знаешь", "знает", "знаем", "знаете", "знают"] },
    { base: "уметь", ru: ["умею", "умеешь", "умеет", "умеем", "умеете", "умеют"] },
    { base: "зависеть", ru: ["завишу", "зависишь", "зависит", "зависим", "зависите", "зависят"] },
    { base: "лететь", ru: ["лечу́", "лети́шь", "лети́т", "лети́м", "лети́те", "летя́т"] },
    { base: "уезжать", ru: ["уезжаю", "уезжаешь", "уезжает", "уезжаем", "уезжаете", "уезжают"] }
]
