import { Conjugation } from '../model/Conjugation';

// remove accens chars: Find and Replace (regexp mode): [\u0300-\u036f]

export const conjugationsNoun: Conjugation[] = [

    { base: 'карта', ru: ['карта', 'карты', 'карте', 'карту', 'картой', 'карте', 'карты', 'карт', 'картам', 'карты', 'картами', 'картах'] },
    { base: 'папа', ru: ['папа', 'папы', 'папе', 'папу', 'папой', 'папе', 'папы', 'пап', 'папам', 'пап', 'папами', 'папах'] },
    { base: 'дядя', ru: ['дядя', 'дяди', 'дяде', 'дядю', 'дядей', 'дяде', 'дяди', 'дядей', 'дядям', 'дядей', 'дядами', 'дядах'] },
    { base: 'земля', ru: ['земля', 'земли', 'земле', 'землю', 'землёй', 'земле', 'земли', 'земель', 'землям', 'земли', 'землями', 'землях'] },
]
