import { Conjugation } from '../model/Conjugation';

// remove accens chars: Find and Replace (regexp mode): [\u0300-\u036f]

export const conjugationsNoun: Conjugation[] = [

    { base: 'карта', ru: ['карта', 'карты', 'карте', 'карту', 'картой', 'карте', 'карты', 'карт', 'картам', 'карты', 'картами', 'картах'] },
    { base: 'папа', ru: ['папа', 'папы', 'папе', 'папу', 'папой', 'папе', 'папы', 'пап', 'папам', 'пап', 'папами', 'папах'] },
    { base: 'дядя', ru: ['дядя', 'дяди', 'дяде', 'дядю', 'дядей', 'дяде', 'дяди', 'дядей', 'дядям', 'дядей', 'дядями', 'дядях'] },
    { base: 'земля', ru: ['земля', 'земли', 'земле', 'землю', 'землёй', 'земле', 'земли', 'земель', 'землям', 'земли', 'землями', 'землях'] },
    { base: "девушка", ru: ["девушка", "девушки", "девушке", "девушку", "девушкой", "девушке", "девушки", "девушек", "девушкам", "девушек", "девушками", "девушках"] },
    { base: "дача", ru: ["дача", "дачи", "даче", "дачу", "дачей", "даче", "дачи", "дач", "дачам", "дачи", "дачами", "дачах"] },
    { base: "география", ru: ["география", "географии", "географии", "географию", "географией", "географии", "географии", "географий", "географиям", "географии", "географиями", "географиях"] },
    { base: "статья", ru: ["статья", "статьи", "статье", "статью", "статьей", "статье", "статьи", "статей", "статьям", "статьи", "статьями", "статьях"] },
    { base: "фильм", ru: ["фильм", "фильма", "фильму", "фильм", "фильмом", "фильме", "фильмы", "фильмов", "фильмам", "фильмы", "фильмами", "фильмах"] },
    { base: "корабль", ru: ["корабль", "корабля", "кораблю", "корабль", "кораблём", "корабле", "корабли", "кораблей", "кораблям", "корабли", "кораблями", "кораблях"] },
    { base: "писатель", ru: ["писатель", "писателя", "писателю", "писателя", "писателем", "писателе", "писатели", "писателей", "писателям", "писателей", "писателями", "писателях"] },
    { base: "окно", ru: ["окно", "окна", "окну", "окно", "окном", "окне", "окна", "окон", "окнам", "окна", "окнами", "окнах"] },
    { base: "море", ru: ["море", "моря", "морю", "море", "морем", "море", "моря", "морей", "морям", "моря", "морями", "морях"] },
    { base: "мальчик", ru: ["мальчик", "мальчика", "мальчику", "мальчика", "мальчиком", "мальчике", "мальчики", "мальчиков", "мальчикам", "мальчиков", "мальчиками", "мальчиках"] },
    { base: "месяц", ru: ["месяц", "месяца", "месяцу", "месяц", "месяцем", "месяце", "месяцы", "месяцев", "месяцам", "месяцы", "месяцами", "месяцах"] },
    { base: "карандаш", ru: ["карандаш", "карандаша", "карандашу", "карандаш", "карандашом", "карандаше", "карандаши", "карандашей", "карандашам", "карандаши", "карандашами", "карандашах"] },
    { base: "сердце", ru: ["сердце", "сердца", "сердцу", "сердце", "сердцем", "сердце", "сердца", "сердец", "сердцам", "сердеца", "сердцами", "сердцах"] },
    { base: "плечо", ru: ["плечо", "плеча", "плечу", "плечо", "плечом", "плече", "плечи", "плечей", "плечам", "плечи", "плечами", "плечах"] },
    { base: "приглашение", ru: ["приглашение", "приглашения", "приглашению", "приглашение", "приглашением", "приглашении", "приглашения", "приглашений", "приглашениям", "приглашения", "приглашениями", "приглашениях"] },
    { base: "животное", ru: ["животное", "животного", "животному", "животное", "животным", "животном", "животные", "животных", "животным", "животные", "животными", "животных"] },
    { base: "лицей", ru: ["лицей", "лицея", "лицею", "лицей", "лицеем", "лицее", "лицея", "лицеев", "лицеям", "лицеи", "лицеями", "лицеях"] },
    { base: "соловей", ru: ["соловей", "соловья", "соловью", "соловья", "соловьём", "соловье", "соловьи", "соловьёв", "соловьям", "соловьи", "соловьями", "соловьях"] },
    { base: "крыло", ru: ["крыло", "крыла", "крылу", "крыло", "крылом", "крыле", "крылья", "крыльев", "крыльям", "крылья", "крыльями", "крыльях"] },
    { base: "стул", ru: ["стул", "стула", "стулу", "стул", "стулом", "стуле", "стулья", "стульев", "стульям", "стулья", "стульями", "стульях"] },
    { base: "друг", ru: ["друг", "друга", "другу", "друга", "другом", "друге", "друзья", "друзей", "друзьям", "друзей", "друзьями", "друзьях"] }

]
